#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shapeshed/asimo/runs/run-HmkdW2XcJuMHFyB7

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
module.s3-us-east-1["com.shapeshed.bomberg"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.clearmatics]
module.s3-us-east-1["com.shapeshed.auster"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.wozniak]
module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.cdn]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.orwell]
module.s3-us-east-1["com.shapeshed.bomberg"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.bomberg"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.bomberg]
module.s3-us-east-1["com.shapeshed.auster"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.auster]
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.auster"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["com.shapeshed.bomberg"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["com.shapeshed.auster"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_caller_identity.current: Reading...
module.s3-us-east-1["com.shapeshed.bomberg"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-static-shapeshed-com.data.aws_caller_identity.current: Reading...
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-static-shapeshed-com.data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-eu-west-1["photos.shapeshed.com"].data.aws_caller_identity.current: Reading...
module.s3-static-shapeshed-com.aws_s3_bucket.this[0]: Refreshing state... [id=static.shapeshed.com]
module.s3-static-shapeshed-com.data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-eu-west-1["creative-corners"].data.aws_caller_identity.current: Reading...
module.s3-eu-west-1["photos.shapeshed.com"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-eu-west-1["photos.shapeshed.com"].aws_s3_bucket.this[0]: Refreshing state... [id=photos.shapeshed.com]
module.s3-eu-west-1["creative-corners"].data.aws_caller_identity.current: Read complete after 0s [id=535487841971]
module.s3-eu-west-1["creative-corners"].aws_s3_bucket.this[0]: Refreshing state... [id=creative-corners]
aws_route53_zone.shapeshed_com: Refreshing state... [id=Z0914809299OFXJQ90CQ9]
module.s3-eu-west-1["photos.shapeshed.com"].data.aws_canonical_user_id.this: Reading...
module.s3-eu-west-1["creative-corners"].data.aws_canonical_user_id.this: Reading...
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.auster:general]
module.s3-us-east-1["com.shapeshed.bomberg"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.bomberg:general]
module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.wozniak:general]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.orwell:general]
module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.cdn:general]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.clearmatics:general]
module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.wozniak,private]
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.auster,private]
module.s3-us-east-1["com.shapeshed.bomberg"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.bomberg,private]
module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.cdn,private]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.clearmatics,private]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.orwell,private]
module.s3-us-east-1["com.shapeshed.bomberg"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.bomberg]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.clearmatics]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.orwell]
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.auster]
module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.cdn]
module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.wozniak]
module.s3-static-shapeshed-com.data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-eu-west-1["creative-corners"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
aws_route53_record.shgsbo4u9t_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shgsbo4u9t.shapeshed.com_CNAME]
aws_route53_record.mx01_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx01.shapeshed.com_A]
aws_route53_record.shapeshed__domainkey_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed._domainkey.shapeshed.com_TXT]
aws_route53_record.__8e912589f272071e6beb0f31146b9819_www_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9__8e912589f272071e6beb0f31146b9819.www.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_NS: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_NS]
aws_route53_record.shapeshed_com_SOA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_SOA]
module.s3-eu-west-1["photos.shapeshed.com"].data.aws_canonical_user_id.this: Read complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
aws_route53_record.shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_AAAA]
aws_route53_record.moxie_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_A]
aws_route53_record.finney_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_finney.shapeshed.com_AAAA]
aws_route53_record.moxie_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_AAAA]
aws_route53_record.imap_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_imap.shapeshed.com_CNAME]
aws_route53_record.moxie__domainkey_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie._domainkey.shapeshed.com_TXT]
aws_route53_record.__dmarc_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9__dmarc.shapeshed.com_TXT]
aws_route53_record.mx02_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx02.shapeshed.com_A]
aws_route53_record.mx01_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx01.shapeshed.com_AAAA]
aws_route53_record.__acme-challenge_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9__acme-challenge.shapeshed.com_TXT]
aws_route53_record.shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_A]
aws_route53_record.shapeshed_com_MX: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_MX]
aws_route53_record.mx02_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx02.shapeshed.com_AAAA]
aws_route53_record.yandex-verification_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_yandex-verification.shapeshed.com_TXT]
aws_route53_record.shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_TXT]
aws_route53_record.finney_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_finney.shapeshed.com_A]
aws_route53_record.googlee87068e8125fba47_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_googlee87068e8125fba47.shapeshed.com_CNAME]
aws_route53_record.d78e316caf6d1de59613b2e5a7e0d62b_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_d78e316caf6d1de59613b2e5a7e0d62b.shapeshed.com_CNAME]
aws_route53_record.w6yzyrt6eyqt_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_w6yzyrt6eyqt.shapeshed.com_CNAME]
aws_route53_record.__26eca8f67eb273a9cafb25ef1989fdf1_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9__26eca8f67eb273a9cafb25ef1989fdf1.shapeshed.com_CNAME]
aws_route53_record.mail_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mail.shapeshed.com_CNAME]
aws_route53_record.smtp_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_smtp.shapeshed.com_CNAME]
module.s3-eu-west-1["photos.shapeshed.com"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=photos.shapeshed.com,private]
module.s3-eu-west-1["creative-corners"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=creative-corners,private]
module.s3-static-shapeshed-com.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=static.shapeshed.com]
module.s3-static-shapeshed-com.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=static.shapeshed.com]
module.s3-eu-west-1["photos.shapeshed.com"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=photos.shapeshed.com]
module.s3-eu-west-1["creative-corners"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=creative-corners]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.shapeshed-com-robots will be created
  + resource "aws_cloudfront_distribution" "shapeshed-com-robots" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + smooth_streaming       = false
          + target_origin_id       = "S3-static.shapeshed.com"
          + trusted_key_groups     = []
          + trusted_signers        = []
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = []

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "robots.txt"
          + smooth_streaming       = false
          + target_origin_id       = "S3-shapeshed.com-robots.txt"
          + trusted_key_groups     = []
          + trusted_signers        = []
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = []

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "static.shapeshed.com.s3-website-eu-west-1.amazonaws.com"
          + origin_id           = "S3-static.shapeshed.com"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "shapeshed.com-robots.txt.s3.amazonaws.com"
          + origin_id           = "S3-shapeshed.com-robots.txt"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = "arn:aws:acm:us-east-1:535487841971:certificate/558d6912-425b-4002-8c7f-6a7fe9b9d408"
          + cloudfront_default_certificate = false
          + minimum_protocol_version       = "TLSv1.1_2016"
          + ssl_support_method             = "sni-only"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @shapeshed, Action: `pull_request`*